## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:109" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:109" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1e9632723b5e9e9f651642c9bf9d474617e2faaa1347767b0698c89519c075d3" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:708a5c4869fb8a106f083efc050aff2438f8baa472f02f6a611ffe55f0796f82"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 109 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/graphql.76a730885efd82da17257019ae006cb0.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "52cd10c00a86a88fca143e75a8224e0a-6" -> "904a8c51cee6884bf43de42fe432012c"
      ~ id                     = "graphql.76a730885efd82da17257019ae006cb0.zip" -> (known after apply)
      ~ key                    = "graphql.76a730885efd82da17257019ae006cb0.zip" -> "graphql.904a8c51cee6884bf43de42fe432012c.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "76a730885efd82da17257019ae006cb0" -> "904a8c51cee6884bf43de42fe432012c"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "LZjXzBloS1jSIxcmvlr8eGKfEORrx7K." -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e6589ecdec5df2315bd2c4a6fd6c1e54-5" -> "3d046486c7ff1f36316f2ad3ab262e5d"
      ~ id                     = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> (known after apply)
      ~ key                    = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "0f990cba3fe4ecb7aa57e3238c68fa76" -> "3d046486c7ff1f36316f2ad3ab262e5d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "1n8__wq8QZnHGi7GQplyvBJmLfha41jD" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.f9acc0ef5e921cbb4e611920116c453c.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1361831940b1e1702f90dce954a1774d-4" -> "96f05c395148b3f642d44452a40f4177"
      ~ id                     = "python.f9acc0ef5e921cbb4e611920116c453c.zip" -> (known after apply)
      ~ key                    = "python.f9acc0ef5e921cbb4e611920116c453c.zip" -> "python.96f05c395148b3f642d44452a40f4177.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "f9acc0ef5e921cbb4e611920116c453c" -> "96f05c395148b3f642d44452a40f4177"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "DSKbUrKVaGtBzlbsWwIUWUwic7XjxpMa" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "753f8fc0d9cb6d56d506c44b73236351" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/200.html"
      ~ source_hash            = "753f8fc0d9cb6d56d506c44b73236351" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "78l2ybviDNqQAFjSJuxC29Z0bDavvHgx" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "27c8df2158111105195f4d2b6d5b98f3" -> "e1c218f420fde98b47676202acec58b8"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "27c8df2158111105195f4d2b6d5b98f3" -> "e1c218f420fde98b47676202acec58b8"
        tags                   = {}
      ~ version_id             = "6tZAlzt1n0NRskP5fxxInfIbpP2ob06y" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "d9d37a17709fa52e418c79933576024c" -> "4e80e6bbd4aac287444ca0f6764923dc"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "d9d37a17709fa52e418c79933576024c" -> "4e80e6bbd4aac287444ca0f6764923dc"
        tags                   = {}
      ~ version_id             = "mb1mAwMTaPC2NTcgQBRwWQ8Z76T1hV_q" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "753f8fc0d9cb6d56d506c44b73236351" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/index.html"
      ~ source_hash            = "753f8fc0d9cb6d56d506c44b73236351" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "wtSL3dsrWa8rMUfTOwwS8I3Osg2Y6Fnc" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c1d20cd2.js"] will be destroyed
  # (because key ["static/js/app.c1d20cd2.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.c1d20cd2.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "1820de3ebddbc671bf902f734b2e84cf" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c1d20cd2.js" -> null
-       key                    = "dist/static/js/app.c1d20cd2.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c1d20cd2.js" -> null
-       source_hash            = "1820de3ebddbc671bf902f734b2e84cf" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "egMiUkPuaegdK5xj0GJEEuGRiurPfRaH" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.c1d20cd2.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.c1d20cd2.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.c1d20cd2.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.c1d20cd2.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.c1d20cd2.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.c1d20cd2.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9g1JLDLdBaMeubHr4BCyg7Q3yysnyZaV" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-22T19:33:53.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:76" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:76/invocations" -> (known after apply)
      ~ s3_key                         = "python.f9acc0ef5e921cbb4e611920116c453c.zip" -> "python.96f05c395148b3f642d44452a40f4177.zip"
        tags                           = {}
      ~ version                        = "76" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
              ~ "DD_TAGS"                      = "git.commit.sha:d65c347f7201a7c03741c6551e890a46b59f337a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2450d9feca34fdf237c79ce2b832b1589cbe41cf,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "76" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-22T19:33:41.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:124" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:124/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.76a730885efd82da17257019ae006cb0.zip" -> "graphql.904a8c51cee6884bf43de42fe432012c.zip"
        tags                           = {}
      ~ version                        = "124" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
              ~ "DD_TAGS"                            = "git.commit.sha:d65c347f7201a7c03741c6551e890a46b59f337a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2450d9feca34fdf237c79ce2b832b1589cbe41cf,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "124" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-22T19:33:55.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:32" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:32/invocations" -> (known after apply)
      ~ s3_key                         = "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" -> "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip"
        tags                           = {}
      ~ version                        = "32" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
              ~ "DD_TAGS"                            = "git.commit.sha:d65c347f7201a7c03741c6551e890a46b59f337a,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2450d9feca34fdf237c79ce2b832b1589cbe41cf,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "d65c347f7201a7c03741c6551e890a46b59f337a" -> "2450d9feca34fdf237c79ce2b832b1589cbe41cf"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "32" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 8 to change, 9 to destroy.
```

</details>

*Pusher: @laurelkorwin, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8795023982)*